app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO `users` (`single_access_token`, `last_request_at`, `created_at`, `crypted_password`, `perishable_token`, `updated_at`, `role`, `failed_login_count`, `current_login_ip`, `password_salt`, `current_login_at`, `persistence_token`, `login_count`, `last_login_ip`, `login`, `last_login_at`, `email`) VALUES('LTcF16ZjNaQ1hLZG71P', '2011-08-29 05:50:32', '2011-08-29 05:50:32', '17ad885319a36fca1fcfbecd0dc14228d718b06be6774753ae6ba552e97e7e3b172bf0af543952b7f694565a824b5f3e49b5e3e1e1d32ba732c0274f1efa79c8', 'fjJVrGJzyRxp12dFUUF5', '2011-08-29 05:50:32', '', 0, '127.0.0.1', '5waDPHiDcEx6H5hBtTs6', '2011-08-29 05:50:32', '57bc60d4079b7e4db146fb5b8c71f38296d245d3906a0ac277e888c0426513702b3795a0a2e03f518813496c3188deba2b341904fa474c03f67defbfb1b1c61b', 1, NULL, 'admin', NULL, 'admin@gmail.com')